zevorn/rt-claw/platform/atk-esp32s3-lvgl/boards/coolse-sp-v2/sdkconfig.defaults
# rt-claw Coolse DIY ESP32-S3 SP V2 — WiFi + PSRAM

# ---- Target: ESP32-S3 ----
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash: 16MB QIO ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# ---- CPU: 240MHz ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ---- PSRAM: 8MB Octal ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
CONFIG_SPIRAM_MEMTEST=n

# ---- Ethernet: disabled (WiFi only) ----
# CONFIG_ETH_USE_SPI_ETHERNET is not set

# ---- WiFi ----
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_LWIP_LOCAL_HOSTNAME="rt-claw"

# ---- TLS: PSRAM allocation + reduced buffers ----
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y

# ---- HTTP server: allow large request headers (captive portal) ----
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# ---- Partition table ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="boards/coolse-sp-v2/partitions.csv"

# ---- Console: UART primary, USB Serial/JTAG secondary ----
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# ---- FreeRTOS ----
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# ---- Dual-core: app logic on Core 1, WiFi/TLS on Core 0 ----
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1=y

# ---- Compiler ----
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_STDIN_LINE_ENDING_LF=y

# ---- rt-claw modules ----
CONFIG_RTCLAW_SHELL_ENABLE=y
# CONFIG_RTCLAW_AUDIO_ENABLE is not set
CONFIG_RTCLAW_SWARM_ENABLE=y
CONFIG_RTCLAW_SCHED_ENABLE=y
CONFIG_RTCLAW_SKILL_ENABLE=y
CONFIG_RTCLAW_TOOL_GPIO=y
CONFIG_RTCLAW_TOOL_SYSTEM=y
CONFIG_RTCLAW_TOOL_SCHED=y
CONFIG_RTCLAW_TOOL_NET=y



# ---- USB HID mouse (TinyUSB) ----
CONFIG_RTCLAW_USB_HID_MOUSE=y
CONFIG_RTCLAW_TOOL_MOUSE=y
CONFIG_TINYUSB_HID_COUNT=1

# ---- IM integrations ----
CONFIG_RTCLAW_FEISHU_ENABLE=y

# ---- OTA ----
CONFIG_RTCLAW_OTA_ENABLE=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ---- User Board Config ----
# CONFIG_RTCLAW_ES8388 is not set
CONFIG_RTCLAW_USE_LVGL=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=y


# AI Engine credentials and tuning: see claw_config.h + meson options
